CSI API ETABS v1

# cSapModelSetPresentUnits_2 Method

---

Specifies the units for the model

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetPresentUnits_2(
    	eForce forceUnits,
    	eLength lengthUnits,
    	eTemperature temperatureUnits
    )

    Function SetPresentUnits_2 (
    	forceUnits As eForce,
    	lengthUnits As eLength,
    	temperatureUnits As eTemperature
    ) As Integer

    Dim instance As cSapModel
    Dim forceUnits As eForce
    Dim lengthUnits As eLength
    Dim temperatureUnits As eTemperature
    Dim returnValue As Integer

    returnValue = instance.SetPresentUnits_2(forceUnits,
    	lengthUnits, temperatureUnits)

    int SetPresentUnits_2(
    	eForce forceUnits,
    	eLength lengthUnits,
    	eTemperature temperatureUnits
    )

    abstract SetPresentUnits_2 :
            forceUnits : eForce *
            lengthUnits : eLength *
            temperatureUnits : eTemperature -> int

#### Parameters

forceUnits

    Type: ETABSv1eForce
A value from the eForce
enumeration

lengthUnits

    Type: ETABSv1eLength
A value from the eLength
enumeration

temperatureUnits

    Type: ETABSv1eTemperature
A value from the eTemperature
enumeration

#### Return Value

Type: Int32
Returns zero if the present units are successfully set, otherwise returns
nonzero

Remarks

Examples

VB

Copy

    Public Sub Example()
           Dim SapModel As cSapModel
           Dim EtabsObject As cOAPI
           Dim ret As Integer = -1

       'create ETABS object
           Dim myHelper as cHelper = New Helper
           EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

       'start ETABS application
           ret = EtabsObject.ApplicationStart()

       'create SapModel object
           SapModel = EtabsObject.SapModel

       'initialize model
           ret = SapModel.InitializeNewModel()

       'set present units
        ret = SapModel.SetPresentUnits_2(eForce.kN, eLength.m, eTemperature.C)

       'create steel deck template model
           ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)

       'get present units
           Dim forceUnits As eForce
           Dim lengthUnits As eLength
           Dim temperatureUnits As eTemperature
           ret = SapModel.GetPresentUnits_2(forceUnits, lengthUnits, temperatureUnits)

       'run model (this will create the analysis model)
           ret = SapModel.Analyze.RunAnalysis

       'close ETABS
           EtabsObject.ApplicationExit(False)

       'clean up variables
           SapModel = Nothing
           EtabsObject = Nothing
       End Sub

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com